{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature mapping file linking product features to frontend source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components and utilities.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, theming, and print-friendly base rules.",
  "frontend/index.html": "Root HTML file loading the React app entry point with a root mount node.",
  "frontend/src/App.tsx": "Main React component managing receipt form state, payments, preview, and PDF generation.",
  "frontend/src/components/receipt/hooks/useLogo.ts": "Manages logo state, allowing upload of a custom logo and resetting to a default image.",
  "frontend/src/components/receipt/hooks/useReceiptSession.ts": "Generates and stores a receipt number, with a function to regenerate it.",
  "frontend/src/components/receipt/hooks/useReceiptTotals.ts": "Computes total payment amount and validity based on a list of payment entries.",
  "frontend/src/components/receipt/LogoUploader.tsx": "UI component enabling drag‑and‑drop or manual upload of custom company logos with reset support.",
  "frontend/src/components/receipt/PaymentsEditor.tsx": "Editor component that renders and updates multiple payment entries including mode, amount, and UTR.",
  "frontend/src/components/receipt/pdf/generateReceiptPdf.ts": "Opens a print window and renders styled HTML to generate and print multiple receipt copies as PDF.",
  "frontend/src/components/receipt/PrintPreviewModal.tsx": "Modal displaying an A4 print preview and providing a button to trigger PDF generation.",
  "frontend/src/components/receipt/PrintSheetA4.tsx": "Renders two stacked receipt previews with a cut‑here separator for A4 print layout.",
  "frontend/src/components/receipt/ReceiptPreview.css": "CSS stylesheet defining typography and layout for a clean, print‑optimized receipt preview.",
  "frontend/src/components/receipt/ReceiptPreview.tsx": "Renders a full receipt preview with header, info, payment table, totals, and signature using provided data and logo.",
  "frontend/src/components/receipt/types.ts": "Defines TypeScript interfaces for payment entries and full receipt data.",
  "frontend/src/components/receipt/utils/date.ts": "Provides helpers for formatting dates, getting today's date, and validating date strings.",
  "frontend/src/components/receipt/utils/money.ts": "Contains functions for parsing, validating, totaling, and formatting monetary amounts.",
  "frontend/src/components/receipt/utils/receiptNumber.ts": "Generates a unique receipt number using the current date and timestamp.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, and identity state management.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, and print-specific A4 layout styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, radius, plugins, and content paths.",
  "project_state.json": "Defines the project’s state, goals, stack, and feature list for a fully client‑side A4 PDF receipt generator with two-copy layout and print/preview support."
}